app/Controllers/Admin/Artikel.php

SELECT *
FROM `layanan`
---
    public function Artikel()
    {
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $artikel = $this->ArtikelModel->search($keyword);
            # code...
        } else {
            $artikel = $this->ArtikelModel;
        }
        $data = [
            'title' => 'Artikel',
            'isi' => 'admin/v_artikel',
            'judul' => 'Artikel',
            'subjudul' => 'Kelola Artikel',
            'menu' => 'artikel',
            'submenu' => 'kelola_artikel',
            'admin' => session()->get(),
            'perusahaan' => $this->PerusahaanModel->DetailData(),
            'layanan' => $this->LayananModel->findAll(),
            'artikel' => $this->ArtikelModel->allData(),
            'pager' => $this->LayananModel->pager,
            // 'currentPage' => $currentPage
        ];

SELECT *
FROM `layanan`
---
    public function TambahArtikel()
    {
        // session();
        $data = [
            'title' => 'Tambah Artikel',
            'isi' => 'admin/v_tambahartikel',
            'judul' => 'Artikel',
            'subjudul' => 'Tambah Artikel',
            'menu' => 'artikel',
            'submenu' => 'tambah_artikel',
            'admin' => session()->get(),
            'perusahaan' => $this->PerusahaanModel->DetailData(),
            'validation' => \Config\Services::validation(),
            'klien' => $this->KlienModel->getklien(),
            'artikel' => $this->ArtikelModel->allData(),
            'layanan' => $this->LayananModel->findAll(),
        ];

SELECT *
FROM `layanan`
---
    public function DetailArtikel($id_artikel)
    {
        $data = [
            'title' => 'Detail Artikel',
            'isi' => 'admin/v_detailartikel',
            'judul' => 'Artikel',
            'subjudul' => 'Detail Artikel',
            'menu' => 'artikel',
            'submenu' => 'detail_artikel',
            'admin' => session()->get(),
            'perusahaan' => $this->PerusahaanModel->DetailData(),
            'validation' => \Config\Services::validation(),
            'artikel' => $this->ArtikelModel->DetailData($id_artikel),
            'layanan' => $this->LayananModel->findAll(),