app/Controllers/Admin/HomeAdmin.php

SELECT *
FROM `layanan`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `layanan`
---
    public function index()
    {
        $layanan = $this->LayananModel->findAll();
        $currentPage = $this->request->getVar('page_layanan') ? $this->request->getVar('page_layanan') : 1;
        // $layanan = $this->LayananModel->findAll();
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $layanan = $this->LayananModel->search($keyword);
            # code...
        } else {
            $layanan = $this->LayananModel;
        }
        $data = [
            'title' => 'Dashboard',
            'isi' => 'admin/v_home',
            'judul' => 'Dashboard',
            'subjudul' => 'Dashboard',
            'menu' => 'dashboard',
            'submenu' => 'dashboard',
            'perusahaan' => $this->PerusahaanModel->DetailData(),
            'layanan' => $this->LayananModel->paginate(5, 'layanan'),

SELECT *
FROM `layanan`
---
    public function DetailLayanan($id)
    {


        $data = [
            'title' => 'Detail Layanan',
            'isi' => 'admin/v_detaillayanan',
            'judul' => 'Layanan',
            'subjudul' => $this->LayananModel->getLayanan($id),
            'menu' => 'layanan',
            'submenu' => 'daftar_layanan',
            'perusahaan' => $this->PerusahaanModel->DetailData(),
            'layanan' => $this->LayananModel->findAll(),