app/Controllers/Admin/Klien.php

SELECT *
FROM `layanan`
SELECT *
FROM `klien`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `klien`
---
    public function DaftarKlien()
    {
        $currentPage = $this->request->getVar('page_klien') ? $this->request->getVar('page_klien') : 1;
        // $layanan = $this->LayananModel->findAll();
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $klien = $this->KlienModel->search($keyword);
            # code...
        } else {
            $klien = $this->KlienModel;
        }
        $data = [
            'title' => 'Daftar Klien',
            'isi' => 'admin/v_klien',
            'menu' => 'klien',
            'submenu' => 'daftar_klien',
            'judul' => 'Klien',
            'subjudul' => 'Daftar Klien',
            'admin' => session()->get(),
            'perusahaan' => $this->PerusahaanModel->DetailData(),
            'layanan' => $this->LayananModel->findAll(),
            'klien' => $this->KlienModel->paginate(5, 'klien'),

SELECT *
FROM `layanan`
---
    public function TambahKlien()
    {
        // session();
        $data = [
            'title' => 'Tambah Klien',
            'isi' => 'admin/v_tambahklien',
            'judul' => 'Klien',
            'subjudul' => 'Tambah Klien',
            'menu' => 'klien',
            'submenu' => 'tambah_klien',
            'admin' => session()->get(),
            'perusahaan' => $this->PerusahaanModel->DetailData(),
            'validation' => \Config\Services::validation(),
            'klien' => $this->KlienModel->getklien(),
            'layanan' => $this->LayananModel->findAll(),