app/Controllers/Admin/Setting.php

    public function Perusahaan()
    {
        $layanan = $this->LayananModel->findAll();
---
SELECT *
FROM `layanan`

    public function Sosmed()
    {
        $layanan = $this->LayananModel->findAll();
---
SELECT *
FROM `layanan`

    public function EditSosmed($id)
    {
        $data = [
            'title' => 'Edit Sosmed',
            'isi' => 'admin/v_editsosmed',
            'judul' => 'Sosial Media',
            'subjudul' => 'Tambah Sosial Media',
            'menu' => 'Setting',
            'submenu' => 'edit_sosmed',
            'perusahaan' => $this->PerusahaanModel->DetailData(),
            'validation' => \Config\Services::validation(),
            'tambahlayanan' => $this->LayananModel->getLayanan(),
            'layanan' => $this->LayananModel->findAll(),
---
SELECT *
FROM `layanan`