app/Views/layoutUser/v_footer.php

 <footer id="footer">

     <?php $db = \Config\Database::connect();
        $perusahaan = $db->table('perusahaan')->where('id_perusahaan', 1)->get()->getRowArray();
        $layanan = $db->table('layanan')->get()
            ->getResultArray();
        $sosmed = $db->table('sosmed')
            ->get()->getResultArray(); ?>
---
SELECT *
FROM `perusahaan`
WHERE `id_perusahaan` = 1
SELECT *
FROM `layanan`
SELECT *
FROM `sosmed`