app/Views/layoutUser/v_head.php

SELECT *
FROM `perusahaan`
WHERE `id_perusahaan` = 1
---
  <meta charset="utf-8">
  <meta content="width=device-width, initial-scale=1.0" name="viewport">
  <?php $db = \Config\Database::connect();
  $perusahaan = $db->table('perusahaan')->where('id_perusahaan', 1)->get()->getRowArray(); ?>