app/Views/layoutUser/v_header.php

SELECT *
FROM `perusahaan`
WHERE `id_perusahaan` = 1
SELECT *
FROM `layanan`
---
<body>
    <?php $db = \Config\Database::connect();
    $perusahaan = $db->table('perusahaan')->where('id_perusahaan', 1)->get()->getRowArray();
    $layanan = $db->table('layanan')->get()
        ->getResultArray() ?>