app/Models/AdminModel.php

SELECT *
FROM `admin`
WHERE `username` = 'shofiudin_wafa'
OR `email` = 'shofiudin_wafa'
---
    public function getData($parameter)
    {
        $builder = $this->table($this->table);
        $builder->where('username', $parameter);
        $builder->orwhere('email', $parameter);
        $query = $builder->get();