app/Models/ArtikelModel.php

    public function allData()
    {
        return $this->db->table('artikel')
            ->join('admin', 'admin.id_user=artikel.id_user', 'LEFT')
            ->orderBy('id_artikel', 'ASC')->get()->getResultArray();
---
SELECT *
FROM `artikel`
LEFT JOIN `admin` ON `admin`.`id_user`=`artikel`.`id_user`
ORDER BY `id_artikel` ASC

    public function DataLimit()
    {
        return $this->db->table('artikel')->join('admin', 'admin.id_user=artikel.id_user', 'LEFT')
            ->limit(8)->orderBy('id_artikel', 'DESC')
            ->get()->getResultArray();
---
SELECT *
FROM `artikel`
LEFT JOIN `admin` ON `admin`.`id_user`=`artikel`.`id_user`
ORDER BY `id_artikel` DESC
 LIMIT 8

    public function DetailData($id_artikel)
    {
        return $this->db->table('artikel')
            ->join('admin', 'admin.id_user=artikel.id_user', 'LEFT')
            ->where(['id_artikel' => $id_artikel])
            ->get()->getRowArray();
---
SELECT *
FROM `artikel`
LEFT JOIN `admin` ON `admin`.`id_user`=`artikel`.`id_user`
WHERE `id_artikel` = '6'

    public function DetailDataArtikel($slug)
    {
        return $this->db->table('artikel')
            ->join('admin', 'admin.id_user=artikel.id_user', 'LEFT')
            ->where(['slug_artikel' => $slug])
            ->get()->getRowArray();
---
SELECT *
FROM `artikel`
LEFT JOIN `admin` ON `admin`.`id_user`=`artikel`.`id_user`
WHERE `slug_artikel` = 'product-manager-tidak-harus-bisa-coding-ini-alasannya'