app/Models/KlienModel.php

SELECT *
FROM `klien`
---
    public function getKlien($id = false)
    {
        if ($id == false) {
            return $this->find();