app/Models/LayananModel.php

    public function getLayanan($id = false)
    {
        if ($id == false) {
            return $this->find();
        }
        return $this->where(['id_layanan' => $id])->first();
---
SELECT *
FROM `layanan`
SELECT *
FROM `layanan`
WHERE `id_layanan` = '19'
 LIMIT 1

    public function getGaleri($id = false)
    {

        $builder = $this->db->table($this->tableGaleri);
        $builder->select('*');
        $builder->join('layanan', 'layanan.id_layanan=galeri_layanan.id_layanan');
        $query = $builder->where('galeri_layanan.id_layanan', $id)->get();
---
SELECT *
FROM `galeri_layanan`
JOIN `layanan` ON `layanan`.`id_layanan`=`galeri_layanan`.`id_layanan`
WHERE `galeri_layanan`.`id_layanan` = '19'

    public function getPaket($id = false)
    {

        $builder = $this->db->table($this->tablePaket);
        $builder->select('*');
        $builder->join('layanan', 'layanan.id_layanan=paket_layanan.id_layanan');
        $query = $builder->where('paket_layanan.id_layanan', $id)->get();
---
SELECT *
FROM `paket_layanan`
JOIN `layanan` ON `layanan`.`id_layanan`=`paket_layanan`.`id_layanan`
WHERE `paket_layanan`.`id_layanan` = '19'