app/Models/PerusahaanModel.php

    public function DetailData()
    {
        return $this->db->table('perusahaan')
            ->where('id_perusahaan', 1)
            ->get()->getRowArray();
---
SELECT *
FROM `perusahaan`
WHERE `id_perusahaan` = 1

    public function AllSosmed()
    {
        return $this->db->table('sosmed')
            ->get()->getResultArray();
---
SELECT *
FROM `sosmed`

    public function UpdateData($data)
    {
        $this->db->table('perusahaan')
            ->where(['id_perusahaan' => $data['id_perusahaan']])
            ->update($data);
---
UPDATE `perusahaan` SET `id_perusahaan` = 1, `nama_perusahaan` = 'Kreasi AI', `alamat_perusahaan` = 'Jl. xxx no.11, xxxxxxxxx', `telp_perusahaan` = '085736463420', `email_perusahaan` = 'kreasiAI@gmail.com', `tentang_kami` = '<p>kami merupakan perusahaan</p>', `logo` = '1696805482_c61810bcaf91db823100.png', `logo_header` = '1696805469_f48ec12afb8ccb7c90b2.png'
WHERE `id_perusahaan` = 1

    public function EditSosmed($id)
    {
        return $this->db->table('sosmed')
            ->where(['id_sosmed' => $id])
            ->get()->getRowArray();
---
SELECT *
FROM `sosmed`
WHERE `id_sosmed` = '3'